export const AIRgpModelParagraph="تعكس هذه الصورة تفاعل الضوء مع الألوان الرقمية على الشاشات.\n" +
  "من خلال نموذج RGB، يستخدم الذكاء الصناعي مزج الأحمر والأخضر والأزرق لإنتاج ملايين الدرجات اللونية الدقيقة، تمامًا كما ترى على شاشات الهواتف والتلفاز.\n" +
  "الهدف: توضيح كيف تُبنى الصورة رقمياً من ثلاث مكونات أساسية لكل بكسل."
export const AICmykModelParagraph="تحاكي هذه الصورة ملمس الطباعة الورقية وتباين الألوان الواقعي.\n" +
  "يعتمد الذكاء الصناعي على نموذج CMYK، حيث يُضاف الحبر تدريجيًا على الورقة البيضاء لتكوين الظلال الداكنة والألوان المركبة.\n" +
  "الهدف: إظهار الفارق بين الطباعة الرقمية والعرض على الشاشة، وفهم كيفية توليد الألوان في الطباعة."
export const AIGrayscaleParagraph="تُبرز هذه الصورة جمالية التدرجات الرمادية وتوازن الضوء والظل دون استخدام اللون.\n" +
  "يحلل الذكاء الصناعي نسب الإضاءة والظلال لإنشاء صورة متناسقة بصريًا، تُظهر التفاصيل الدقيقة والتباين بين العناصر.\n" +
  "الهدف: تعليم المشاهد كيف يمكن للظل والضوء خلق تأثير بصري متكامل حتى في غياب الألوان."
export const AIRgpDigitalImagesParagraph="تمثل هذه الصورة التكامل بين الذكاء الصناعي والخيال الإنساني.\n" +
  "يولد الذكاء الصناعي تصميمًا إبداعيًا يجمع بين الأشكال والألوان والنماذج اللونية المختلفة، ويُظهر قدرة التقنية على تحفيز الإبداع البشري وتوسيع آفاق الفن الرقمي.\n" +
  "الهدف: توضيح كيف يمكن للذكاء الصناعي أن يكون أداة مساعدة للفنانين والمصممين لإنشاء أعمال جديدة وغير مسبوقة."
export const AIFirstDialogImagesParagraph="يعتمد الذكاء الصناعي على:\n" +
  "\n" +
  "التعلّم العميق (Deep Learning)\n" +
  "\n" +
  "الشبكات التوليدية (Generative Models)\n" +
  "\n" +
  "يقوم النظام بتحليل ملايين الصور، واستخراج أنماط الألوان، الأشكال، والإضاءة، ثم توليد صور جديدة لم يسبق رؤيتها من قبل، تمزج بين الدقة التقنية والخيال الفني."
export const AISecondDialogImagesParagraph=" أبرز تطبيقات الذكاء الصناعي في الصور:\n" +
  "\n" +
  "تصميم الشخصيات والمناظر الطبيعية في الألعاب.\n" +
  "\n" +
  "توليد لوحات فنية بأساليب مختلفة (مثل فان غوخ، بيكاسو).\n" +
  "\n" +
  "إنشاء تصاميم دعائية وشعارات مبتكرة بسرعة وكفاءة.\n" +
  "\n" +
  "استخدامه في الطب لتوليد صور تحليلية وأدوات تعليمية رقمية."
